<template>
  <section id="browserSupport" class="body-1">
    <h1 class="display-4 mb-5">مرورگرهای قابل استفاده</h1>
    <p>
      رنوسیفای یک فریمورک پیشرو است که تلاش می کند توسعه وب را به لول بعدی ببرد.
      برای انجام بهتر این کار ، باید فداکاری هایی در زمینه پشتیبانی از نسخه های
      قدیمی اینترنت اکسپلورر انجام داد. این یک لیست کامل از مرورگرهای سازگار
      نیست ، بلکه مرورگرهای اصلی مورد نظر است.
    </p>
    <r-table
        :items="[
        { مرورگر: 'گوگل کروم', پشتیبانی: 'می کند' },
        { مرورگر: 'مایکروسافت اچ', پشتیبانی: 'می کند' },
        { مرورگر: 'فایرفاکس', پشتیبانی: 'می کند' },
        { مرورگر: 'سافاری', پشتیبانی: 'می کند' },
      ]"
        borderd
    ></r-table>
  </section>
</template>

<script>
export default {
  name: "browserSupport",
  data() {
    return {};
  },
};
</script>
