<template>
  <section id="introduction">
    <h2 class="display-4">معرفی</h2>
    <p class="my-5 body-1">
      درباره رنوسیفای، نحوه ایجاد برنامه از ابتدا، مرور منابع API، کدهای نمونه،
      آموزشها و موارد دیگر بیشتر بدانید.
    </p>
  </section>
  <section id="what_renusify" class="mt-10">
    <h2 class="display-4 mb-5">رنوسیفای چیست؟</h2>
    <p class="body-1">
      رنوسیفای یک فریمورک UI است که بر پایه vueJs ساخته شده است. هدف این پروژه
      ارائه ابزارها و کمپوننت هایی هست که برای ایجاد یک رابط کاربری زیبا بر اساس
      طراحی متریال توسعه دهندگان نیاز دارند.
    </p>
    <p class="body-1">
      با استفاده از رنوسیفای شما به راحتی می توانید با یک بار کد زدن تمام پلتفرم
      های موبایل و دسکتاپ را پشتیبانی کنید. همچنین برنامه قابلیت نصب بر روی
      دستگاه های مختلف را خواهد داشت(pwa).
    </p>
  </section>
  <section id="why_renusify" class="mt-10">
    <h1 class="display-4 mb-5">چرا رنوسیفای؟</h1>
    <ul class="ms-5 body-1">
      <li>سرعت بالای توسعه</li>
      <li>کمپوننت های زیاد</li>
      <li>دایرکتیو های زیاد</li>
      <li>سهولت یادگیری</li>
      <li>پرفورمنس بالا</li>
      <li>پشتیبانی از تمامی زبان ها</li>
      <li>پشتیبانی از تاریخ های زنده دنیا</li>
      <li>پشتیبانی از جهت راست به چپ</li>
      <li>تم رنگ دلخواه</li>
    </ul>
  </section>
</template>

<script>
export default {
  name: "why_renusify",
  data() {
    return {};
  },
};
</script>
