<template>
  <section id="support">
    <h1 class="display-4 mb-5">ارتقا</h1>
    <p class="body-1">
      سرعت زیاد رشد وب باعث تغییرات گسترده در زبان ها و کتابخانه ها می شود.
      رنوسیفای از حداقل کتابخانه های خارجی استفاده می کند که این خود کار توسعه
      را راحتتر می کند.
    </p>
    <p class="body-1">
      با تغییرات مهم در نسخه های مختلف کتابخانه ها ما اطمینان حاصل می کنیم تا در
      سریعترین زمان ممکن بروزرسانی های لازم را در تمامی فریمورک رنوسیفای انجام
      دهیم تا هم برنامه ها از لحاظ امنیتی با مشکل مواجه نشوند و هم اینکه از
      جدیدترین تکنولوژی ها بتوانید در پروژه هایتان استفاده کنید.
    </p>
  </section>
  <section id="bugs" class="mt-10">
    <h2 class="display-4 mb-5">مشکلات و باگ</h2>
    <p class="body-1">
      چنانچه در مورد کارکرد برنامه با مشکل مواجه شدید می توانید سوالات خود را با
      ما در میان بگذارید تا بهترین راه حل را به شما ارائه دهیم.
    </p>
    <p class="body-1">
      فریمورک رنوسیفای بر روی چندین دستگاه مختلف تست می شود و سعی شده است که
      بدون نقص و باگ باشد اما در دنیای برنامه نویسی همیشه امکان وجود باگ وجود
      دارد. چنانچه یک باگ را شناسایی کردید سریعا آن را به ما اطلاع دهید تا در
      کمترین زمان آن را برطرف کنیم.
    </p>
  </section>
  <section id="roadmap" class="mt-10">
    <h2 class="display-4 mb-5">نقشه راه</h2>
    <p class="body-1">
      رنوسیفای همیشه در دست توسعه است. ما به طور مداوم در تلاش هستیم تا کد
      پایگاه موجود را بهبود بخشیم ، همچنین ویژگی ها و قابلیت های جدیدی اضافه می
      کنیم که به ساده سازی برنامه ها کمک می کند. در زیر لیستی آزمایشی از ویژگی
      های برنامه ریزی شده آورده شده است. این یک لیست جامع نیست و هر زمان که
      بخواهید بدون اطلاع قبلی تغییر می کند.
    </p>
    <ul class="body-1 ms-5">
      <li>به کمپوننت ویرایشگر نوشته جدول اضافه شود</li>
      <li>اضافه کردن تست</li>
      <li>بروزرسانی داکیومنت</li>
      <li>ایجاد قالب های آماده</li>
    </ul>
  </section>
</template>

<script>
export default {
  name: "support",
  data() {
    return {};
  },
};
</script>
